Tekla.Structures.Model.Internal.LiveSharingModelType
Model types used in live sharing

Tekla.Structures.Model.Internal.LiveSharingModelType.FullModel
Full model

Tekla.Structures.Model.Internal.LiveSharingModelType.DiffModel
Diff model

Tekla.Structures.Model.Internal.LiveSharingModelType.ViewModel
View model